brbeardm/PelletPirate/pelletpirate_ESP/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Custom partition table: 1.5MB app + 2.4MB LittleFS (see partitions.csv)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# LVGL fonts
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# LVGL color settings - byte swap for SPI displays (big-endian wire format)
CONFIG_LV_DRAW_SW_SUPPORT_RGB565_SWAPPED=y

# WebSocket support for the WiFi dashboard
CONFIG_HTTPD_WS_SUPPORT=y
